[
    {
        "first_name": "Tiffanie",
        "middle_inital": "M",
        "last_name":"Johnson",
        "email":"tjohns29@gmu.edu",
        "city":"Washington, D.C.",
        "jobs":[
            {
                "company":"ISL","position":"Web Developer","location":[{"city":"Washington","state": "DC" }],"start_date":"02282018","end_date":"00000000","description":"Kick Ass FE Dev with an expanding backend flow."
            },
            {
                "company":"JobSpring-The Washington Post","position":"Javascript Developer","location":[{"city":"Washington","state": "DC" }],"start_date":"04012017","end_date":"02012018", "descriptions":"Develop and maintain the front end functionality of online publications. Work closely with business system analyst to translate requirements into actionable tasks. Implement bug fixes and new features based on end-user feedback. Enhance the SEO for the e-commerce by utilizing AMP technology to optimize performance on both mobile and desktop."
            },
            {
                "company":"Forum One","position":"Full Stack Javascript Developer", "location":[{"city":"Alexandria","state": "VA" }],"start_date":"04012016","end_date":"070120187","description":"Developed single-page application in AngularJsv1.3+. Used UI-Router to map states to views and resolve state dependencies.Created client-side services to query data from back-end services. Updated project dependencies with Npm and grunt. Used D3js libraries to transform data and create intuitive data visualization features. Used LeafletJS libraries to create interactive map applications. Use of JavaScript libraries such as JQuery, Underscore, AnimateJs, Less.js, and Iconic onto of vanilla JavaScript to speed up development time. Complete exposure to all phases of the software development life cycle, including architecture, analysis, design, development, Testing, performance tuning, and implementation. Add new functionality to existing software. Creating custom fields, Post Types and templates in WordPress. Converted product requirements into actionable development task."
            },
            {
                "company":"Leidos","position":"Java Developer","location":[{"city":"Alexandria","state": "VA" }],"start_date":"06012015","end_date":"04012016","description":"Developed large, cutting edge imaging applications. Code and test full-stack web application software based on an Agile Scrum approach. Continuous integration and test automation while supporting software reuse and refactoring. Software configuration management Determine software components and their interface requirements."
            },
            {
                "company":"Tasc","position":"Software Developer","location":[{"city":"Chantilly","state": "VA" }],"start_date":"05012013","end_date":"08028014","description":"Developed Python analysis tools to solve orbit and tracking system challendes. Developed computer vision algorithm application to identify, categorize, and manipulate images. Designed advanced modeling simulation testing of complex data for mission critical projects in MATLAB. Created Java application/UI to access and manipulate geographic information shapefiles with GeoTools Technology research and evaluations for future contracts"
            }

        ],
        "education":[
            {
                "school":"George Mason University", "degree":"B.A.", "major": "Mathematics", "start_date":"2012", "end_date":"2015", "location":[{"city":"Fairfax","state": "VA" }], "graduate":"yes"
            },
            {
                "school":"NorthernVirginia Community College", "degree":"A.S","major":"Electrical Engineering", "start_date":"2010", "end_date":"2012", "location":[{"city":"Fairfax","state": "VA" }], "graduate":"yes"
            }
        ]
    }
]